Ran Plan for dir: `terragrunt/kubernetes/vault` workspace: `terragrunt_kubernetes_vault`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' 'terragrunt plan -input=false $(printf '%s' $COMMENT_ARGS | sed 's/,/ /g' | tr -d '\\') -no-color -out $PLANFILE' in '/home/atlantis/.atlantis/repos/youhide/hideForming/78/terragrunt_kubernetes_vault/terragrunt/kubernetes/vault': exit status 1: running "terragrunt plan -input=false $(printf '%s' $COMMENT_ARGS | sed 's/,/ /g' | tr -d '\\\\') -no-color -out $PLANFILE" in "/home/atlantis/.atlantis/repos/youhide/hideForming/78/terragrunt_kubernetes_vault/terragrunt/kubernetes/vault": 
01:01:30.253 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/z41wjz4r9L131TN6VrhArQnf_m4/VTwr6MviaB5op4wVZCz7M2mJlNM
01:01:30.274 INFO   tofu: Initializing the backend...
01:01:30.291 INFO   tofu: Successfully configured the backend "s3"! OpenTofu will automatically
01:01:30.291 INFO   tofu: use this backend unless the backend configuration changes.
01:01:30.310 INFO   tofu: Initializing provider plugins...
01:01:30.310 INFO   tofu: - Reusing previous version of gavinbunney/kubectl from the dependency lock file
01:01:30.660 INFO   tofu: - Reusing previous version of aminueza/minio from the dependency lock file
01:01:30.757 INFO   tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
01:01:30.892 INFO   tofu: - Reusing previous version of hashicorp/vault from the dependency lock file
01:01:31.010 INFO   tofu: - Reusing previous version of telmate/proxmox from the dependency lock file
01:01:31.090 INFO   tofu: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
01:01:31.221 INFO   tofu: - Reusing previous version of hashicorp/helm from the dependency lock file
01:01:31.325 INFO   tofu: - Reusing previous version of goauthentik/authentik from the dependency lock file
01:01:31.677 INFO   tofu: - Installing goauthentik/authentik v2025.8.1...
01:01:32.547 INFO   tofu: - Installed goauthentik/authentik v2025.8.1. Signature validation was skipped due to the registry not containing GPG keys for this provider
01:01:32.808 INFO   tofu: - Installing gavinbunney/kubectl v1.19.0...
01:01:34.034 INFO   tofu: - Installed gavinbunney/kubectl v1.19.0 (signed, key ID 1E1CE42504F5FBB2)
01:01:34.326 INFO   tofu: - Installing aminueza/minio v3.5.0...
01:01:34.964 INFO   tofu: - Installed aminueza/minio v3.5.0. Signature validation was skipped due to the registry not containing GPG keys for this provider
01:01:35.254 INFO   tofu: - Installing cloudflare/cloudflare v5.4.0...
01:01:36.884 INFO   tofu: - Installed cloudflare/cloudflare v5.4.0 (signed, key ID C76001609EE3B136)
01:01:37.188 INFO   tofu: - Installing hashicorp/vault v4.8.0...
01:01:38.245 INFO   tofu: - Installed hashicorp/vault v4.8.0 (signed, key ID 0C0AF313E5FD9F80)
01:01:38.502 INFO   tofu: - Installing telmate/proxmox v3.0.1-rc8...
01:01:39.086 INFO   tofu: - Installed telmate/proxmox v3.0.1-rc8. Signature validation was skipped due to the registry not containing GPG keys for this provider
01:01:39.448 INFO   tofu: - Installing hashicorp/kubernetes v2.36.0...
01:01:40.645 INFO   tofu: - Installed hashicorp/kubernetes v2.36.0 (signed, key ID 0C0AF313E5FD9F80)
01:01:40.968 INFO   tofu: - Installing hashicorp/helm v3.0.0-pre2...
01:01:42.235 INFO   tofu: - Installed hashicorp/helm v3.0.0-pre2 (signed, key ID 0C0AF313E5FD9F80)
01:01:42.235 INFO   tofu: Providers are signed by their developers.
01:01:42.235 INFO   tofu: If you'd like to know more about provider signing, you can read about it here:
01:01:42.235 INFO   tofu: https://opentofu.org/docs/cli/plugins/signing/
01:01:42.235 INFO   tofu: OpenTofu has made some changes to the provider dependency selections recorded
01:01:42.235 INFO   tofu: in the .terraform.lock.hcl file. Review those changes and commit them to your
01:01:42.235 INFO   tofu: version control system if they represent changes you intended to make.
01:01:42.253 INFO   tofu: OpenTofu has been successfully initialized!
01:01:43.210 STDOUT tofu: vault_policy.external_secrets: Refreshing state... [id=external-secrets]
01:01:43.214 STDOUT tofu: kubernetes_cluster_role_binding.vault_token_reviewer: Refreshing state... [id=vault-token-reviewer]
01:01:43.214 STDOUT tofu: kubernetes_namespace.external_secrets: Refreshing state... [id=external-secrets]
01:01:43.215 STDOUT tofu: vault_auth_backend.kubernetes: Refreshing state... [id=kubernetes]
01:01:43.217 STDOUT tofu: data.kubernetes_config_map.kube_config: Reading...
01:01:43.220 STDOUT tofu: data.kubernetes_config_map.kube_config: Read complete after 0s [id=default/kube-root-ca.crt]
01:01:43.229 STDOUT tofu: helm_release.external_secrets: Refreshing state... [id=external-secrets]
01:01:43.229 STDOUT tofu: kubernetes_role.external_secrets_role: Refreshing state... [id=external-secrets/external-secrets-role]
01:01:43.237 STDOUT tofu: kubernetes_role_binding.external_secrets_rolebinding: Refreshing state... [id=external-secrets/external-secrets-rolebinding]
01:01:45.448 STDOUT tofu: kubernetes_secret.external_secrets_token: Refreshing state... [id=external-secrets/external-secrets-token]
01:01:50.703 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
01:01:50.703 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
01:01:50.703 STDOUT tofu:   ~ update in-place
01:01:50.703 STDOUT tofu: OpenTofu planned the following actions, but then encountered a problem:
01:01:50.703 STDOUT tofu:   # helm_release.external_secrets will be updated in-place
01:01:50.704 STDOUT tofu:   ~ resource "helm_release" "external_secrets" {
01:01:50.704 STDOUT tofu:       ~ id                         = "external-secrets" -> (known after apply)
01:01:50.704 STDOUT tofu:       ~ metadata                   = {
01:01:50.704 STDOUT tofu:           ~ app_version    = "v0.20.4" -> (known after apply)
01:01:50.704 STDOUT tofu:           ~ chart          = "external-secrets" -> (known after apply)
01:01:50.704 STDOUT tofu:           ~ first_deployed = 1746657171 -> (known after apply)
01:01:50.704 STDOUT tofu:           ~ last_deployed  = 1761356437 -> (known after apply)
01:01:50.704 STDOUT tofu:           ~ name           = "external-secrets" -> (known after apply)
01:01:50.704 STDOUT tofu:           ~ namespace      = "external-secrets" -> (known after apply)
01:01:50.704 STDOUT tofu:           ~ revision       = 11 -> (known after apply)
01:01:50.704 STDOUT tofu:           ~ values         = jsonencode(
01:01:50.704 STDOUT tofu:                 {
01:01:50.704 STDOUT tofu:                   - installCRDs    = true
01:01:50.704 STDOUT tofu:                   - serviceAccount = {
01:01:50.704 STDOUT tofu:                       - create = true
01:01:50.704 STDOUT tofu:                       - name   = "external-secrets"
01:01:50.704 STDOUT tofu:                     }
01:01:50.704 STDOUT tofu:                 }
01:01:50.704 STDOUT tofu:             ) -> (known after apply)
01:01:50.704 STDOUT tofu:           ~ version        = "0.20.4" -> (known after apply)
01:01:50.704 STDOUT tofu:         } -> (known after apply)
01:01:50.704 STDOUT tofu:         name                       = "external-secrets"
01:01:50.704 STDOUT tofu:       ~ version                    = "0.20.4" -> "1.1.0"
01:01:50.704 STDOUT tofu:         # (26 unchanged attributes hidden)
01:01:50.704 STDOUT tofu:     }
01:01:50.704 STDOUT tofu: Plan: 0 to add, 1 to change, 0 to destroy.
01:01:50.704 STDERR tofu: Error: failed to lookup token, err=Error making API request.
01:01:50.704 STDERR tofu: URL: GET http://vault.localdomain:8200/v1/auth/token/lookup-self
01:01:50.705 STDERR tofu: Code: 503. Errors:
01:01:50.705 STDERR tofu: * Vault is sealed
01:01:50.705 STDERR tofu:   with vault_auth_backend.kubernetes,
01:01:50.705 STDERR tofu:   on main.tf line 100, in resource "vault_auth_backend" "kubernetes":
01:01:50.705 STDERR tofu:  100: resource "vault_auth_backend" "kubernetes" {
01:01:50.705 STDERR tofu: Error: failed to lookup token, err=Error making API request.
01:01:50.705 STDERR tofu: URL: GET http://vault.localdomain:8200/v1/auth/token/lookup-self
01:01:50.705 STDERR tofu: Code: 503. Errors:
01:01:50.705 STDERR tofu: * Vault is sealed
01:01:50.705 STDERR tofu:   with vault_policy.external_secrets,
01:01:50.705 STDERR tofu:   on main.tf line 114, in resource "vault_policy" "external_secrets":
01:01:50.705 STDERR tofu:  114: resource "vault_policy" "external_secrets" {
01:01:50.712 ERROR  tofu invocation failed in ./.terragrunt-cache/z41wjz4r9L131TN6VrhArQnf_m4/VTwr6MviaB5op4wVZCz7M2mJlNM
01:01:50.712 ERROR  error occurred:

* Failed to execute "tofu plan -input=false -out ./terragrunt_kubernetes_vault.tfplan -no-color" in ./.terragrunt-cache/z41wjz4r9L131TN6VrhArQnf_m4/VTwr6MviaB5op4wVZCz7M2mJlNM
  
  Error: failed to lookup token, err=Error making API request.
  
  URL: GET http://vault.localdomain:8200/v1/auth/token/lookup-self
  Code: 503. Errors:
  
  * Vault is sealed
  
    with vault_auth_backend.kubernetes,
    on main.tf line 100, in resource "vault_auth_backend" "kubernetes":
   100: resource "vault_auth_backend" "kubernetes" {
  
  
  Error: failed to lookup token, err=Error making API request.
  
  URL: GET http://vault.localdomain:8200/v1/auth/token/lookup-self
  Code: 503. Errors:
  
  * Vault is sealed
  
    with vault_policy.external_secrets,
    on main.tf line 114, in resource "vault_policy" "external_secrets":
   114: resource "vault_policy" "external_secrets" {
  
  
  exit status 1


Authenticated

```
</details>